   -- -----------------------------------------------------------------------------
-- 1. Nα συντάξετε ένα ερώτημα όπου θα φαίνεται ποιες ειδικότητες (employee.job)
--  εργάζονται σε κάθε τμήμα. Tαξινομήστε ανά κωδικό τμήματος και ειδικότητα.
-- For each Department, show the jobs (employee.job) the employees are occupied 
-- with. Order the results by department number and job name 
-- -----------------------------------------------------------------------------
-- SQL:
SELECT DISTINCT workdept,
   job
FROM employee
ORDER BY workdept,
   job;

-- Αποτελέσματα:
Τ01	ΑΝΑΛΥΤΗΣ
Τ01	ΔΙΕΥΘΥΝΤΗΣ
Τ01	ΛΟΓΙΣΤΗΣ
Τ02	ΑΝΑΛΥΤΗΣ
Τ02	ΔΙΕΥΘΥΝΤΗΣ
Τ02	ΛΟΓΙΣΤΗΣ
Τ03	ΑΝΑΛΥΤΗΣ
Τ03	ΓΡΑΜΜΑΤΕΑΣ
Τ03	ΔΙΕΥΘΥΝΤΗΣ
Τ03	ΠΩΛΗΤΗΣ
Τ04	ΓΡΑΜΜΑΤΕΑΣ
Τ04	ΔΙΕΥΘΥΝΤΗΣ
Τ04	ΛΟΓΙΣΤΗΣ
Τ05	ΑΝΑΛΥΤΗΣ
Τ05	ΓΡΑΜΜΑΤΕΑΣ
Τ05	ΔΙΕΥΘΥΝΤΗΣ
Τ06	ΑΝΑΛΥΤΗΣ
Τ06	ΓΡΑΜΜΑΤΕΑΣ
Τ06	ΔΙΕΥΘΥΝΤΗΣ
Τ07	ΔΙΕΥΘΥΝΤΗΣ
Τ07	ΠΡΟΓΡΑΜΜΑΤΙΣΤΗΣ
Τ08	ΔΙΕΥΘΥΝΤΗΣ
Τ08	ΤΗΛΕΦΩΝΗΤΗΣ
Τ09	ΑΝΑΛΥΤΗΣ
Τ09	ΓΡΑΜΜΑΤΕΑΣ
Τ09	ΔΙΕΥΘΥΝΤΗΣ
Τ10	ΑΝΑΛΥΤΗΣ
Τ10	ΔΙΕΥΘΥΝΤΗΣ
Τ10	ΨΥΧΟΛΟΓΟΣ
Τ11	ΔΙΕΥΘΥΝΤΗΣ
Τ11	ΤΗΛΕΦΩΝΗΤΗΣ
Τ12	ΑΝΑΛΥΤΗΣ
Τ12	ΑΡΧΙΤΕΚΤΟΝΑΣ

-- -------------------------------------------------------------------------
-- 2. Να βρεθεί το όνομα του τμήματος στο οποίο εργάζεται ο εργαζόμενος με 
-- κωδικό 000130. Χρησιμοποιήστε το JOIN.
-- Find the Department nubmer where employee 000130 works. Use JOIN.
-- -------------------------------------------------------------------------
-- SQL:
SELECT department.DEPTNAME
FROM employee
JOIN department ON employee.WORKDEPT = department.DEPTNO
WHERE empno = '000130';

-- Αποτελέσματα:
ΔΙΟΙΚΗΣΗ
-- -----------------------------------------------------------------------------
-- 3. Βρείτε τα ονόματα και οι μισθοί (SALARY) όλων των διευθυντών (ΔΙΕΥΘΥΝΤΗΣ) 
-- ταξινομημένα με φθίνον ύψος μισθού και αύξουσα αλφ. σειρά επωνύμου.
-- Find the names and salaries (SALARY) of all managers (Job is 'ΔΙΕΥΘΥΝΤΗΣ')
-- ordered by descending salary and ascending lastname
-- -----------------------------------------------------------------------------
-- SQL:
SELECT firstname,
   lastname,
   salary
FROM employee
WHERE job = 'ΔΙΕΥΘΥΝΤΗΣ'
ORDER BY salary DESC, lastname;

SELECT firstname,
   lastname,
   salary
FROM employee
WHERE job like 'ΔΙΕΥΘΥΝΤΗΣ%'
ORDER BY salary DESC, lastname;

-- Αποτελέσματα:

ΠΑΝΑΓΙΩΤΗΣ	ΚΑΠΡΑΛΟΣ	100000
ΧΡΗΣΤΟΣ	ΚΟΥΛΟΧΕΡΗΣ	90000
ΑΡΤΕΜΗΣ	ΛΙΑΚΟΠΟΥΛΟΣ	90000
ΚΑΛΛΙΟΠΗ	ΚΑΠΑΓΙΑΝΝΗ	80000
ΑΝΤΩΝΗΣ	ΚΑΡΑΤΖΑΣ	60000
ΙΩΑΝΝΑ	ΚΥΡΙΑΚΟΥ	55000
ΚΥΡΙΑΚΟΣ	ΙΩΑΝΝΟΥ	50000
ΔΗΜΗΤΡΗΣ	ΚΑΖΑΤΖΗΣ	50000
ΑΝΤΩΝΙΑ	ΠΟΛΥΧΡΟΝΑΚΗ	50000
ΧΡΙΣΤΙΝΑ	ΚΑΜΕΝΟΥ	40000
ΜΑΝΩΛΗΣ	ΜΑΡΓΑΡΙΤΗΣ	25000
-- -----------------------------------------------------------------------------
-- 4. Έστω ότι η επιχείρηση πρόκειται εν όψει των Χριστουγέννων να δώσει πρόσθε-
-- τη μηνιαία αμοιβή 300 ευρώ σε κάθε εργαζόμενο. Ειδικά για τους διευθυντές 
-- (ΔΙΕΥΘΥΝΤΗΣ) των τμημάτων η αμοιβή αυτή θα είναι 600 ευρώ. Να κατασκευάσετε 
-- τις μισθολογικές καταστάσεις του μήνα Δεκεμβρίου για όλους τους εργαζόμενους 
-- της επιχείρησης, πριν και μετά την αύξηση (αρ. Μητρώου, επώνυμο, όνομα, 
-- μισθός Δεκεμβρίου χωρίς το δώρο, μισθός Δεκεμβρίου με το δώρο). Να 
-- ταξινομήσετε τα αποτελέσματα αυτού του ερωτήματος κατά αλφαβητική σειρά με 
-- βάση το επίθετο. (Σημ. Το πεδίο SALARY έχει τον ετήσιο μισθό).
-- Μπορείτε να χρησιμοποιήσετε και τη ROUND, αν δε σας ενδιαφέρουν τα δεκαδικά.
-- The company intends to give a Christmas bonus of 300€ to each employee.
-- Especially for the managers of the departments (Job is 'ΔΙΕΥΘΥΝΤΗΣ'), the 
-- bonus is 600€. Create a payroll for the month December, where it is shown,
-- for each employee: empno, last name, first name, december salary without the
-- bonus, december salara including the bonus. Note that the field SALARY shows
-- the yearly salary. You can also use the round() function if you want to round
-- the results. 
-- -----------------------------------------------------------------------------
-- Απάντηση:
SELECT * FROM (
SELECT lastname,
   firstname,
   round(salary / 12) AS salary,
   round(salary / 12 + 600) AS christmas_salary
FROM employee
WHERE job = 'ΔΙΕΥΘΥΝΤΗΣ'
UNION 
SELECT lastname,
   firstname,
   round(salary / 12),
   round(salary / 12 + 300) 
FROM employee
WHERE job != 'ΔΙΕΥΘΥΝΤΗΣ') AS totals ORDER BY lastname ;

-- Αποτελέσματα:
 ΑΡΑΠΟΓΛΟΥ	ΕΛΕΥΘΕΡΙΑ	1500.0	1800.0
ΑΡΑΧΤΟΣ	ΛΕΩΝΙΔΑΣ	1333.0	1633.0
ΒΑΛΣΑΜΗ	ΑΛΕΞΙΑ	2083.0	2383.0
ΒΑΛΣΑΜΗ	ΒΑΣΙΛΙΚΗ	2083.0	2383.0
ΓΕΩΡΓΙΟΥ	ΙΩΑΝΝΗΣ	2916.0	3216.0
ΓΙΑΝΝΟΠΟΥΛΟΣ	ΙΩΑΝΝΗΣ	2083.0	2383.0
ΓΙΑΝΝΟΥΛΗΣ	ΝΙΚΟΛΑΟΣ	833.0	1133.0
ΓΚΙΟΚΑ	ΙΩΣΗΦΙΝΑ	1583.0	1883.0
ΓΚΙΩΝΑΚΗΣ	ΑΝΕΣΤΗΣ	1416.0	1716.0
ΔΕΜΕΤΗ	ΑΓΓΕΛΙΚΗ	1583.0	1883.0
ΔΗΜΗΤΡΙΟΥ	ΣΤΑΜΑΤΗΣ	1000.0	1300.0
ΔΙΑΜΑΝΤΟΠΟΥΛΟΣ	ΑΓΗΣΙΛΑΟΣ	1333.0	1633.0
ΔΡΙΛΛΗΣ	ΣΤΕΛΙΟΣ	2000.0	2300.0
ΘΑΛΑΣΣΙΝΟΣ	ΝΙΚΟΛΑΟΣ	1166.0	1466.0
ΙΩΑΝΝΟΥ	ΚΥΡΙΑΚΟΣ	4166.0	4766.0
ΚΑΖΑΤΖΗΣ	ΔΗΜΗΤΡΗΣ	4166.0	4766.0
ΚΑΛΑΠΑΝΙΔΑΣ	ΑΡΙΣΤΕΙΔΗΣ	1666.0	2266.0
ΚΑΛΠΑΚΙΔΗΣ	ΔΗΜΗΤΡΙΟΣ	1000.0	1300.0
ΚΑΜΕΝΟΥ	ΧΡΙΣΤΙΝΑ	3333.0	3933.0
ΚΑΠΑΓΙΑΝΝΗ	ΚΑΛΛΙΟΠΗ	6666.0	7266.0
ΚΑΠΑΚΛΗΣ	ΦΑΝΗΣ	833.0	1133.0
ΚΑΠΡΑΛΟΣ	ΠΑΝΑΓΙΩΤΗΣ	8333.0	8933.0
ΚΑΡΑΤΖΑΣ	ΑΝΤΩΝΗΣ	5000.0	5600.0
ΚΑΡΑΦΛΟΣ	ΓΕΩΡΓΙΟΣ	2416.0	2716.0
ΚΑΤΣΑΤΟΥ	ΧΑΡΑ	1328.0	1628.0
ΚΑΦΑΝΤΑΡΗ	ΕΛΛΗ	1000.0	1300.0
ΚΙΤΡΙΝΟΣ	ΔΗΜΟΣΘΕΝΗΣ	1041.0	1341.0
ΚΟΥΛΟΧΕΡΗΣ	ΧΡΗΣΤΟΣ	7500.0	8100.0
ΚΥΡΙΑΚΟΥ	ΙΩΑΝΝΑ	4583.0	5183.0
ΛΑΜΙΑΣ	ΔΗΜΗΤΡΗΣ	1000.0	1300.0
ΛΑΜΠΡΟΠΟΥΛΟΥ	ΑΛΕΚΑ	1583.0	1883.0
ΛΙΑΚΟΠΟΥΛΟΣ	ΑΡΤΕΜΗΣ	7500.0	8100.0
ΛΙΑΚΟΥ	ΓΕΩΡΓΙΑ	1250.0	1550.0
ΜΑΝΙΑΤΗΣ	ΑΧΙΛΛΕΑΣ	1333.0	1633.0
ΜΑΡΓΑΡΙΤΗΣ	ΜΑΝΩΛΗΣ	2083.0	2683.0
ΜΠΛΑΤΣΙΩΤΗΣ	ΑΘΑΝΑΣΙΟΣ	1328.0	1628.0
ΝΑΝΟΠΟΥΛΟΣ	ΔΗΜΗΤΡΙΟΣ	1250.0	1550.0
ΝΙΑΡΧΟΥ	ΜΕΛΕΤΗΣ	1416.0	1716.0
ΞΥΠΟΛΙΑ	ΘΑΛΕΙΑ	1433.0	1733.0
ΠΑΠΑΡΙΖΟΣ	ΑΝΤΩΝΗΣ	1166.0	1466.0
ΠΑΠΑΧΡΗΣΤΟΣ	ΕΛΕΥΘΕΡΙΟΣ	1000.0	1300.0
-- -----------------------------------------------------------------------------
-- 5. Να φτιάξετε μια κατάσταση που να περιέχει το όνομα, το επίθετο, 
-- την ειδικότητα, το όνομα του τμήματος που ανήκει και το επίθετο του διευθυντή
-- του αντίστοιχου τμήματος, για κάθε εργαζόμενο που δεν είναι αναλυτής 
-- (ΑΝΑΛΥΤΗΣ) και δεν είναι διευθυντής (ΔΙΕΥΘΥΝΤΗΣ), ταξινομημένα ανά επώνυμο 
-- και όνομα.
-- Create a listcontaining the name, the last name, the job name, the name of
-- the department where the employee belongs and the last name of the manager
-- of that department, for every employee who is not an analyst ('ΑΝΑΛΥΤΗΣ') or
-- a manager ('ΔΙΕΘΥΝΤΗΣ'). Ordery by last name and first name.
-- -----------------------------------------------------------------------------
-- Απάντηση:
 SELECT e.firstname, e.lastname, e.job, d.deptname, e2.lastname
FROM employee e
JOIN department d ON
e.workdept = d.deptno
JOIN employee e2 ON
d.mgrno = e2.empno
WHERE e.job != 'ΑΝΑΛΥΤΗΣ'
AND e.empno NOT IN ( SELECT mgrno
FROM department )
ORDER BY e.lastname, e.firstname;

-- Αποτελέσματα:

ΕΛΕΥΘΕΡΙΑ	ΑΡΑΠΟΓΛΟΥ	ΑΡΧΙΤΕΚΤΟΝΑΣ	ΚΑΤΑΣΚΕΥΑΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΖΑΤΖΗΣ
ΛΕΩΝΙΔΑΣ	ΑΡΑΧΤΟΣ	ΛΟΓΙΣΤΗΣ	ΤΜΗΜΑ ΠΡΟΜΗΘΕΙΩΝ	ΙΩΑΝΝΟΥ
ΑΛΕΞΙΑ	ΒΑΛΣΑΜΗ	ΨΥΧΟΛΟΓΟΣ	ΤΜΗΜΑ ΠΡΟΣΛΗΨΕΩΝ	ΛΙΑΚΟΠΟΥΛΟΣ
ΒΑΣΙΛΙΚΗ	ΒΑΛΣΑΜΗ	ΨΥΧΟΛΟΓΟΣ	ΤΜΗΜΑ ΠΡΟΣΛΗΨΕΩΝ	ΛΙΑΚΟΠΟΥΛΟΣ
ΙΩΑΝΝΗΣ	ΓΕΩΡΓΙΟΥ	ΠΩΛΗΤΗΣ	ΤΜΗΜΑ ΠΩΛΗΣΕΩΝ	ΚΑΠΑΓΙΑΝΝΗ
ΝΙΚΟΛΑΟΣ	ΓΙΑΝΝΟΥΛΗΣ	ΓΡΑΜΜΑΤΕΑΣ	ΔΙΑΦΗΜΙΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΜΕΝΟΥ
ΣΤΑΜΑΤΗΣ	ΔΗΜΗΤΡΙΟΥ	ΤΗΛΕΦΩΝΗΤΗΣ	ΤΜΗΜΑ ΕΞΥΠΗΡΕΤΗΣΗΣ ΠΕΛΑΤΩΝ	ΠΟΛΥΧΡΟΝΑΚΗ
ΑΓΗΣΙΛΑΟΣ	ΔΙΑΜΑΝΤΟΠΟΥΛΟΣ	ΗΛΕΚΤΡΟΛΟΓΟΣ	ΚΑΤΑΣΚΕΥΑΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΖΑΤΖΗΣ
ΣΤΕΛΙΟΣ	ΔΡΙΛΛΗΣ	ΛΟΓΙΣΤΗΣ	ΛΟΓΙΣΤΗΡΙΟ	ΚΟΥΛΟΧΕΡΗΣ
ΝΙΚΟΛΑΟΣ	ΘΑΛΑΣΣΙΝΟΣ	ΛΟΓΙΣΤΗΣ	ΔΙΟΙΚΗΣΗ	ΚΑΠΡΑΛΟΣ
ΔΗΜΗΤΡΙΟΣ	ΚΑΛΠΑΚΙΔΗΣ	ΗΛΕΚΤΡΟΛΟΓΟΣ	ΚΑΤΑΣΚΕΥΑΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΖΑΤΖΗΣ
ΓΕΩΡΓΙΟΣ	ΚΑΡΑΦΛΟΣ	ΠΡΟΓΡΑΜΜΑΤΙΣΤΗΣ	ΤΜΗΜΑ ΗΛΕΚΤΡΟΝΙΚΗΣ ΔΙΑΦΗΜΙΣΗΣ	ΚΑΡΑΤΖΑΣ
ΔΗΜΟΣΘΕΝΗΣ	ΚΙΤΡΙΝΟΣ	ΓΡΑΜΜΑΤΕΑΣ	ΤΜΗΜΑ ΠΡΟΣΩΠΙΚΟΥ	ΚΑΛΑΠΑΝΙΔΑΣ
ΔΗΜΗΤΡΗΣ	ΛΑΜΙΑΣ	ΓΡΑΜΜΑΤΕΑΣ	ΤΜΗΜΑ ΠΡΟΜΗΘΕΙΩΝ	ΙΩΑΝΝΟΥ
ΑΛΕΚΑ	ΛΑΜΠΡΟΠΟΥΛΟΥ	ΠΟΛΙΤΙΚΟΣ ΜΗΧΑΝΙΚΟΣ	ΚΑΤΑΣΚΕΥΑΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΖΑΤΖΗΣ
ΓΕΩΡΓΙΑ	ΛΙΑΚΟΥ	ΠΩΛΗΤΗΣ	ΤΜΗΜΑ ΠΩΛΗΣΕΩΝ	ΚΑΠΑΓΙΑΝΝΗ
ΑΧΙΛΛΕΑΣ	ΜΑΝΙΑΤΗΣ	ΤΗΛΕΦΩΝΗΤΗΣ	ΤΜΗΜΑ ΕΞΥΠΗΡΕΤΗΣΗΣ ΠΡΟΣΩΠΙΚΟΥ	ΚΥΡΙΑΚΟΥ
ΜΕΛΕΤΗΣ	ΝΙΑΡΧΟΥ	ΑΡΧΙΤΕΚΤΟΝΑΣ	ΚΑΤΑΣΚΕΥΑΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΖΑΤΖΗΣ
ΘΑΛΕΙΑ	ΞΥΠΟΛΙΑ	ΠΟΛΙΤΙΚΟΣ ΜΗΧΑΝΙΚΟΣ	ΚΑΤΑΣΚΕΥΑΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΖΑΤΖΗΣ
ΑΝΤΩΝΗΣ	ΠΑΠΑΡΙΖΟΣ	ΓΡΑΜΜΑΤΕΑΣ	ΤΜΗΜΑ ΕΝΤΥΠΗΣ ΔΙΑΦΗΜΙΣΗΣ	ΜΑΡΓΑΡΙΤΗΣ
ΗΛΙΑΣ	ΠΟΛΙΤΗΣ	ΠΡΟΓΡΑΜΜΑΤΙΣΤΗΣ	ΤΜΗΜΑ ΗΛΕΚΤΡΟΝΙΚΗΣ ΔΙΑΦΗΜΙΣΗΣ	ΚΑΡΑΤΖΑΣ
ΝΙΚΗ	ΠΟΛΥΧΡΟΝΑΚΗ	ΓΡΑΜΜΑΤΕΑΣ	ΤΜΗΜΑ ΠΩΛΗΣΕΩΝ	ΚΑΠΑΓΙΑΝΝΗ
ΓΙΩΡΓΟΣ	ΦΙΩΤΑΚΗΣ	ΛΟΓΙΣΤΗΣ	ΛΟΓΙΣΤΗΡΙΟ	ΚΟΥΛΟΧΕΡΗΣ
ΜΙΛΤΙΑΔΗΣ	ΧΑΡΑΛΑΜΠΟΥΣ	ΠΩΛΗΤΗΣ	ΤΜΗΜΑ ΠΩΛΗΣΕΩΝ	ΚΑΠΑΓΙΑΝΝΗ
ΑΝΤΡΕΑΣ	ΧΑΣΑΠΟΓΛΟΥ	ΑΡΧΙΤΕΚΤΟΝΑΣ	ΚΑΤΑΣΚΕΥΑΣΤΙΚΟ ΤΜΗΜΑ	ΚΑΖΑΤΖΗΣ

-- -----------------------------------------------------------------------------
-- 6. Ανακτήστε το όνομα και το επίθετο των εργαζομένων που συμμετέχουν στο 
-- πρότζεκτ 003301 περισσότερο από τον μισό τους χρόνο. 
-- (Το emp_act.emptime δείχνει το ποσοστό απασχόλησης ενός εργαζομένου σε κάποιο 
-- πρότζεκτ, δηλαδή αν EMPTIME = 60 => ο εργαζόμενος δουλεύει το 60% των 
-- εβδομαδιαίων ωρών απασχόλησης στο πρότεκτ). Θεωρήστε πως οι εργαζόμενοι 
-- δουλεύουν 5*8=40 ώρες την εβδομάδα. Ταξινομήστε με επίθετο και όνομα.
-- Show the name and last name of the employees who work in project 003301 more
-- than half their time. Note that emp_act.emptime shows how much time an emp-
-- loyee spends on a project, as a percentage of his or her weekly time, e.g.
-- emptime=60 means that the employee spends 60% of his or her time on the 
-- project (assume that the total time per week is 5*8=40 hours). Order by 
-- surname and name.
-- -----------------------------------------------------------------------------
-- Απάντηση:
 SELECT firstname, lastname
FROM emp_act
JOIN employee ON
emp_act.empno = employee.empno
WHERE projno = '003301'
AND emp_act.emptime > 50
ORDER BY lastname, firstname;
-- Αποτελέσματα:
ΙΩΑΝΝΗΣ	ΓΕΩΡΓΙΟΥ
ΓΕΩΡΓΙΑ	ΛΙΑΚΟΥ
ΜΙΛΤΙΑΔΗΣ	ΧΑΡΑΛΑΜΠΟΥΣ
ΑΝΤΡΕΑΣ	ΨΑΡΙΑΝΟΣ

-- -----------------------------------------------------------------------------
-- 7. Βρείτε το όνομα και το επίθετο των εργαζόμενων που στο ή στα πρότζεκτ  που
-- εργάζονται είναι υπεύθυνος ο κ. KAZATZHΣ. (O υπεύθυνος κάθε πρότζεκτ 
-- δηλώνεται στο πεδίο project.resemp). Ταξινομήστε με επίθετο και όνομα.
-- Find the name and surname of the employees whose projects are supervised by
-- Mr. "ΚΑΖΑΤΖΗΣ". Each project's supervisor is found in project.resemp. Order
-- by surname and name.
-- -----------------------------------------------------------------------------
-- Απάντηση:
 SELECT DISTINCT e1.firstname, e1.lastname
FROM emp_act AS ea
JOIN employee AS e1 ON
ea.empno = e1.empno
JOIN project p ON
ea.projno = p.projno
JOIN employee e2 ON
p.resemp = e2.empno
WHERE e2.lastname = 'ΚΑΖΑΤΖΗΣ'
ORDER BY e1.lastname, e1.firstname;
-- Αποτελέσματα:
ΝΙΚΟΛΑΟΣ	ΘΑΛΑΣΣΙΝΟΣ
ΑΘΑΝΑΣΙΟΣ	ΜΠΛΑΤΣΙΩΤΗΣ
ΑΝΤΩΝΗΣ	ΠΑΠΑΡΙΖΟΣ
ΝΙΚΗ	ΠΟΛΥΧΡΟΝΑΚΗ
ΓΙΩΡΓΟΣ	ΦΙΩΤΑΚΗΣ

-- -----------------------------------------------------------------------------
-- 8. Ανακτήστε το όνομα και το επίθετο των εργαζομένων που δεν απασχολούνται σε
--  κανένα έργο και δεν είναι διευθυντές (ΔΙΕΥΘΥΝΤΗΣ). 
-- -----------------------------------------------------------------------------
-- Απάντηση:
SELECT DISTINCT lastname, firstname
FROM employee e1
WHERE e1.empno NOT IN (SELECT e2.empno
                       FROM emp_act e2 where e2.emstdate<date() and e2.emenddate>date())
                and job!='ΔΙΕΥΘΥΝΤΗΣ'

-- Αποτελέσματα:

ΣΚΟΠΕΛΙΤΗΣ	ΑΡΙΣΤΟΤΕΛΗΣ
ΠΟΛΙΤΗΣ	ΗΛΙΑΣ
ΠΑΠΑΧΡΗΣΤΟΣ	ΕΛΕΥΘΕΡΙΟΣ
ΘΑΛΑΣΣΙΝΟΣ	ΝΙΚΟΛΑΟΣ
ΚΑΤΣΑΤΟΥ	ΧΑΡΑ
ΧΑΣΑΠΟΓΛΟΥ	ΑΝΤΡΕΑΣ
ΣΩΤΗΡΙΟΥ	ΔΙΟΜΗΔΗΣ
ΔΕΜΕΤΗ	ΑΓΓΕΛΙΚΗ
ΓΕΩΡΓΙΟΥ	ΙΩΑΝΝΗΣ
ΔΡΙΛΛΗΣ	ΣΤΕΛΙΟΣ
ΚΑΡΑΦΛΟΣ	ΓΕΩΡΓΙΟΣ
ΠΟΛΥΧΡΟΝΑΚΗ	ΝΙΚΗ
ΛΑΜΙΑΣ	ΔΗΜΗΤΡΗΣ
ΝΑΝΟΠΟΥΛΟΣ	ΔΗΜΗΤΡΙΟΣ
ΔΗΜΗΤΡΙΟΥ	ΣΤΑΜΑΤΗΣ
ΛΑΜΠΡΟΠΟΥΛΟΥ	ΑΛΕΚΑ
ΚΑΛΠΑΚΙΔΗΣ	ΔΗΜΗΤΡΙΟΣ
ΓΙΑΝΝΟΠΟΥΛΟΣ	ΙΩΑΝΝΗΣ
ΓΙΑΝΝΟΥΛΗΣ	ΝΙΚΟΛΑΟΣ
ΒΑΛΣΑΜΗ	ΑΛΕΞΙΑ
ΔΙΑΜΑΝΤΟΠΟΥΛΟΣ	ΑΓΗΣΙΛΑΟΣ
ΞΥΠΟΛΙΑ	ΘΑΛΕΙΑ
ΓΚΙΟΚΑ	ΙΩΣΗΦΙΝΑ
ΚΑΠΑΚΛΗΣ	ΦΑΝΗΣ
ΜΑΝΙΑΤΗΣ	ΑΧΙΛΛΕΑΣ
ΒΑΛΣΑΜΗ	ΒΑΣΙΛΙΚΗ
ΧΑΡΑΛΑΜΠΟΥΣ	ΜΙΛΤΙΑΔΗΣ
ΓΚΙΩΝΑΚΗΣ	ΑΝΕΣΤΗΣ
ΚΙΤΡΙΝΟΣ	ΔΗΜΟΣΘΕΝΗΣ
ΝΙΑΡΧΟΥ	ΜΕΛΕΤΗΣ
ΚΑΦΑΝΤΑΡΗ	ΕΛΛΗ
ΑΡΑΧΤΟΣ	ΛΕΩΝΙΔΑΣ
ΑΡΑΠΟΓΛΟΥ	ΕΛΕΥΘΕΡΙΑ

-- -----------------------------------------------------------------------------
-- 9. Να βρεθεί ο μέσος μισθός όλων των εργαζομένων γυναικών. 
-- (Το φύλο δηλώνεται στο πεδίο SEX)
-- Find the average salary of all women employees (empoloyee.sex='Θ')
-- -----------------------------------------------------------------------------
-- SQL:
SELECT avg(salary)
from employee
where sex = 'Θ';
-- Αποτελέσματα:

28009.6
